/**************************************************************************
*                      К  У  Р  С      О  О  П                            *
*-------------------------------------------------------------------------*
*                                                                         *
* Project Name  : \Курсы_С++\Lesson_05_Принципы _ООП\Ex05_02              *
* Project Type  : Win32 Console application                               *
* File Name     : Ex05_02_Con.cpp                                         *
* Language      : Visual C++           MS VS 2015                         *
* Programmer(s) : Чечиков Ю.Б.  &   Безродных И.П.                        *
* Modified By   : Чечиков Ю.Б.                                            *
* Created       : 28 / 04 / 2004                                          *
* Last Revision : 06 / 01 / 2016                                          *
* Comment(s)    : Рисует на рабочем столе по вертикали 6 точек     *
 *                 и линию                                          *
*                                                                         *
***************************************************************************/

#pragma once                  
#include <windows.h>
#include <conio.h>
#include <iostream>    
using namespace std;           // Пространство имен std
#include "Point05_02.h"

//макрос для определения кода нажатой клавиши
#define KEY_DOWN(vk_code) ((GetAsyncKeyState(vk_code) & 0x8000) ? 1 : 0)

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*   Г Л О Б А Л Ь Н Ы Е   П Е Р Е М Е Н Н Ы Е  И  К О Н С Т А Н Т Ы   */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

HDC hdc;// Объявим контекст устройства
                // Контекст устройства по сути это структура,
                // содержащая описание видеокарты на вашем компьютере
                // и всех необходимых графических элементов

/*---------------------------------------------------------------------*/
/*               П Р О Т О Т И П Ы    Ф У Н К Ц И Й                    */
/*---------------------------------------------------------------------*/
HWND GetConcolWindow(); //указатель на консольное окно

/***********************************************************************/
/*               О С Н О В Н А Я    П Р О Г Р А М М А                  */
/***********************************************************************/
void main()
{
    //объявление и инициализация переменных
    int x0 = 130;        //стартовые координаты точки
    int y0 = 250;
    int i, j = 0;

    //получим дескриптор консольного окна
    HWND hwnd = GetConcolWindow();

    //если дескриптор существует
    if (hwnd != NULL)
    {
        //получим контекст устройства для консольного окна
        hdc = GetWindowDC(hwnd);

        //если контекст существует - можем работать
        if (hdc != 0)
        {
            //===================================================================
            //        М Е С Т О    В С Т А В К И         

            // создаем экземпляр класса
            Point APoint(x0, y0);
            APoint.Show(); // показать точку
            cin.get(); // задержка экрана
            // вывод в консольное окно
            cout << APoint.GetX() << endl;

            // 6 точек по горизонтале с задержкой
            APoint.MoveTo(230, 200); // показать точку
            cin.get(); // задержка экрана

            APoint.MoveTo(230, 210); // показать точку
            cin.get(); // задержка экрана

            APoint.MoveTo(230, 220); // показать точку
            cin.get(); // задержка экрана

            APoint.MoveTo(230, 230); // показать точку
            cin.get(); // задержка экрана

            APoint.MoveTo(230, 240); // показать точку
            cin.get(); // задержка экрана

            APoint.MoveTo(230, 250); // показать точку
            cin.get(); // задержка экрана

            APoint.MoveTo(200, 200); // показать точку



                                   
            while (1) // бесконечный цикл
            {
                j++;
                for (i = 0; i < 100; i = i + 2) {
                    //переместить точку на 2 пискеля вниз
                    APoint.MoveTo(200, 200 + i); // показать точку
                    Sleep(150); // задержка процесса

                }//for i

                if (j == 50) j = 0;

            } // while
            //===================================================================
        }//end if
    }//end if
}//end main()

/*---------------------------------------------------------------------*/
/*               Р Е А Л И З А Ц И Я   Ф У Н К Ц И Й                   */
/*---------------------------------------------------------------------*/

/*----------------------------------------------------------------------*/
/*  Создать консольное окно  */
/*---------------------------*/
HWND GetConcolWindow()
{
    char str[128];
    // char title[128]="xxxxxxxxxxxxxxxxxx";
    LPWSTR title = (LPWSTR)"xxxxxxxxxxxxxxxxxx";        //новая версия Windows
    GetConsoleTitle((LPWSTR)str, sizeof((LPWSTR)str)); // получить заголовок окна
    SetConsoleTitle(title);                                                // установить новый заголовок окна
    Sleep(100);                                                                        // ждем смены заголовка окна (100 мс);

    HWND hwnd = FindWindow(NULL, (LPWSTR)title);// определяем дескриптор окна
    SetConsoleTitle((LPWSTR)str);                                //возвращаем прежний заголовок

    return hwnd;//вернуть дескриптор окна
}//end GetConcolWindow()

/**********************  End Of Ex05_02_Con.CPP File ********************/
