#pragma once
/*******************************************************************************
*                      К  У  Р  С  Ы     С  +  +                              *
*-----------------------------------------------------------------------------*
*                                                                             *
* Project Name  : \Курсы_С++\Lesson_05_Принципы _ООП\Ex05_02                  *
* File Name     : Point05_02.h                                                *
* Programmer(s) : Чечиков Ю.Б.  &   Безродных И.П.                            *
* Modifyed By   :                                                             *
* Created       : 28/04/04                                                    *
* Last Revision : 15/10/04                                                    *
* Comment(s)    : ОБЪЯВЛЕНИЕ ДВУХ КЛАССОВ. НАСЛЕДОВАНИЕ                       *
*                                                                             *
*******************************************************************************/

//#include <iostream.h>

/*-----------------------------------------------------------------------------*/
/*                         Т И П Ы    Д А Н Н Ы Х                              */
/*-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------*/
class Location
{
protected:     //предоставляет возможность потомкам (производному 
			   //классу) иметь доступ к частным данным
	int X;
	int Y;

public:   //эти методы доступны извне всем в программе

	Location(int InitX, int InitY);  //конструктор
	~Location();                     //деструктор
	int GetX();
	int GetY();
};

/*-----------------------------------------------------------------------------*/
class Point : public Location
{
	// Point - производный класс от Location
	// атрибут public в объявлении производного класса означает, что X и Y являются 
	// защищенными (protected) внутри Point - полученными по наследству

protected:         //классам, производным от Point, потребуется доступ public
	bool Visible;   //светится точка или нет

public:
	Point(int InitX, int InitY);   //конструктор класса
	~Point();                       //деструктор
	void Show(); // показать точку на экране
	void Hide(); // скрыть точку на экране
	bool IsVisible();  //узнать про светимость точки
	void MoveTo(int NewX, int NewY);
};

/************************   End of File POINT05_02.H     ********************/
